Qutaiba-Khader/rf24-scanner/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE only. Classic is not needed and its controller memory is released at
# boot, which matters on a 320 KB part also running Wi-Fi.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_GATTS_ENABLE=n
CONFIG_BT_GATTC_ENABLE=n
CONFIG_BT_BLE_SMP_ENABLE=n

# Wi-Fi and BLE share one radio; without software coexistence the scans
# corrupt each other rather than merely queueing.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Driver chatter on the same UART as the data lines would make the host parser
# guess. Only real errors get through.
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_MAXIMUM_LEVEL_ERROR=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
